Revit 2024 API
Zone.CreateAreaBasedLoad Method
 Creates a new instance of an area based load and adds it to the document.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public static Zone CreateAreaBasedLoad(
	Document doc,
	string name,
	ElementId levelId,
	ElementId phaseId
)
Visual Basic
Public Shared Function CreateAreaBasedLoad ( _
	doc As Document, _
	name As String, _
	levelId As ElementId, _
	phaseId As ElementId _
) As Zone
Visual C++
public:
static Zone^ CreateAreaBasedLoad(
	Document^ doc,
	String^ name,
	ElementId^ levelId,
	ElementId^ phaseId
)
Parameters
doc
Type: Autodesk.Revit.DB.Document
 The document where the element will be created and added.
name
Type: System.String
 The name of the area based load to be created.
levelId
Type: Autodesk.Revit.DB.ElementId
 The base level on which the area based load will be created.
phaseId
Type: Autodesk.Revit.DB.ElementId
 The associative phase on which the area based load is to exist.
Return Value
 The newly created area based load.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~". -or- name is an empty string. -or- The ElementId levelId is not a Level. -or- The id does not represent a valid phase.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
Autodesk.Revit.Exceptions.ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
Autodesk.Revit.Exceptions.ModificationOutsideTransactionException |  The document has no open transaction.
See Also
Zone Class
Autodesk.Revit.DB.Mechanical Namespace